OpenFOAM-13/tutorials/multiphaseEuler/fluidisedBed/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (particles air);

referencePhase  air;

particles
{
    type            purePhaseModel;

    diameterModel   constant;
    constantCoeffs
    {
        d               3e-4;
    }

    alphaMax        0.62;
    residualAlpha   1e-6;
}

air
{
    type            purePhaseModel;

    diameterModel   none;

    residualAlpha   0;
}

blending
{
    default
    {
        type            continuous;
        phase           air;
    }
}

surfaceTension
{}

// ************************************************************************* //
